Tekla.Structures.Analysis.AnalysisModelGeneralProperties
The AnalysisModelGeneralProperties class contains the general property information for an analysis model.

Tekla.Structures.Analysis.AnalysisModelGeneralProperties._AnalysisEngineName
Name of analysis engine.

Tekla.Structures.Analysis.AnalysisModelGeneralProperties._ModelName
Name of model.

Tekla.Structures.Analysis.AnalysisModelGeneralProperties._ModelCreationType
Model creation type.

Tekla.Structures.Analysis.AnalysisModelGeneralProperties._ModalAnalysisModel
Model analysis model.

Tekla.Structures.Analysis.AnalysisModelGeneralProperties._FilterName
Name of filter.

Tekla.Structures.Analysis.AnalysisModelGeneralProperties._MemberAxisLocation
Location of member axis.

Tekla.Structures.Analysis.AnalysisModelGeneralProperties._NodeDefinition
Node definition .

Tekla.Structures.Analysis.AnalysisModelGeneralProperties._ExtendedClashCheck
ExtendedClashCheck.

Tekla.Structures.Analysis.AnalysisModelGeneralProperties._ModelMerging
Model merging.

Tekla.Structures.Analysis.AnalysisModelGeneralProperties._MemberEndReleaseMethodByConnection
MemberEndReleaseMethodByConnection.

Tekla.Structures.Analysis.AnalysisModelGeneralProperties.#ctor
Creates a new analysis model general properties instance.

Tekla.Structures.Analysis.AnalysisModelGeneralProperties.AnalysisEngineName
The name of the analysis engine.

Tekla.Structures.Analysis.AnalysisModelGeneralProperties.ModelName
The name of the model.

Tekla.Structures.Analysis.AnalysisModelGeneralProperties.ModelCreationType
The model creation type.

Tekla.Structures.Analysis.AnalysisModelGeneralProperties.ModalAnalysisModel
Defines whether the modal analysis properties are used instead of the static load combinations.

Tekla.Structures.Analysis.AnalysisModelGeneralProperties.FilterName
The name of the filter.

Tekla.Structures.Analysis.AnalysisModelGeneralProperties.MemberAxisLocation
The location of the member axis.

Tekla.Structures.Analysis.AnalysisModelGeneralProperties.NodeDefinition
Defines how the nodes and node positions are defined.

Tekla.Structures.Analysis.AnalysisModelGeneralProperties.ExtendedClashCheck
Defines whether the extended clash check is used.

Tekla.Structures.Analysis.AnalysisModelGeneralProperties.ModelMerging
Defines whether the model merging is used.

Tekla.Structures.Analysis.AnalysisModelGeneralProperties.MemberEndReleaseMethodByConnection
Defines whether the support conditions of connections or parts are used.